goole1-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: goole1-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: goole1-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  goole1-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1536,673)
      - go(https://www.google.com/search?sxsrf=ALeKk01Qc8sPdgF7KpoVNmtMgqC3xmmuUw%3A1596249184189&source=hp&ei=YNQkX4CYCZXnz7sPvN262Ag&q=test+automation&oq=test+automation&gs_lcp=CgZwc3ktYWIQAzIICAAQsQMQkQIyBQgAEJECMgIIADICCAAyAggAMgIIADICCAAyAggAMgIIADICCAA6BAgjECc6BAguECc6CwgAELEDEIMBEJECOggIABCxAxCDAToFCAAQsQM6CwguELEDEMcBEKMCOgcIABCxAxBDOg0ILhCxAxDHARCjAhBDOgQIABBDUKETWIMrYJU2aABwAHgBgAHHA4gBnBSSAQgwLjE0LjQtMZgBAKABAaoBB2d3cy13aXo&sclient=psy-ab&ved=0ahUKEwiAyODM-_jqAhWV83MBHbyuDosQ4dUDCAc&uact=5)
      - typeByName(q): "test automation"
      - submitByID(tsf)

  goole1-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/84.0.4147.105 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://www.google.com/'
            method: GET
            label: 'https://www.google.com/'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: ''
              cp: '0'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: t
              cp: '1'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: te
              cp: '2'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: tes
              cp: '3'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: test
              cp: '4'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: 'test '
              cp: '5'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: test a
              cp: '6'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: test au
              cp: '7'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: test aut
              cp: '8'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: test auto
              cp: '9'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: test autom
              cp: '10'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: test automa
              cp: '11'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: test automat
              cp: '12'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: test automati
              cp: '13'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: test automatio
              cp: '14'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: test automation
              cp: '15'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: TdUkX6vmFtXaz7sP7Omv-AQ.1596249423019
              dpr: '1.25'
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
          - url: 'https://www.google.com/search'
            method: GET
            label: 'https://www.google.com/search'
            think-time: 1408ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
            body:
              sxsrf: 'ALeKk00bkBP8zyt1R_ABYwhHjpNaqIsXig:1596249421422'
              source: hp
              ei: TdUkX6vmFtXaz7sP7Omv-AQ
              q: test automation
              oq: test automation
              gs_lcp: CgZwc3ktYWIQAzIECCMQJzICCAAyAggAMgQIABBDMgIIADICCAAyAggAMgIIADICCAAyAggAOgQILhAnOgoIABCxAxCDARBDOgUIABCxAzoKCAAQsQMQFBCHAjoLCC4QsQMQxwEQowI6CAgAELEDEIMBOgcIABCxAxBDOgcIABAUEIcCUPwhWKE0YPU-aABwAHgAgAH5AYgBmBOSAQYwLjE0LjGYAQCgAQGqAQdnd3Mtd2l6
              sclient: psy-ab
              ved: 0ahUKEwjrwO-9_PjqAhVV7XMBHez0C08Q4dUDCAc
              uact: '5'
          - url: 'https://www.google.com/async/bgasy'
            method: GET
            label: 'https://www.google.com/async/bgasy'
            headers:
              Accept: '*/*'
            body:
              ei: V9UkX6iHGZLbz7sP76iLoAk
              yv: '3'
              async: '_fmt:jspb'
          - url: 'https://www.google.com/async/ugc_ms_ss'
            method: GET
            label: 'https://www.google.com/async/ugc_ms_ss'
            headers:
              Accept: '*/*'
            body:
              ei: V9UkX6iHGZLbz7sP76iLoAk
              yv: '3'
              async: 'num_questions:10,question1:UgwVjVdOdLWU3-uqv4p4AaABGg,question2:UgwmgeZF0CKMAFFTmR54AaABGg,question3:UgyUQ2e8DIfu2wYI02Z4AaABGg,question4:Ugw4hnFYJs0YKuV0gO94AaABGg,question5:UgzDRQ3OM1u6Utj6-z54AaABGg,question6:UgxkbKfX1NwSp8uSnlF4AaABGg,question7:Ugz1BzXTT2WByUUOdGt4AaABGg,question8:UgxnkpWnudcOrhHuCJ14AaABGg,question9:UgzuoFn6IyBwuHidDpJ4AaABGg,question10:UgzGwexmKidyP5DCgq94AaABGg,_fmt:jspb'
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: ''
              cp: '0'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              pq: test automation
              psi: V9UkX6iHGZLbz7sP76iLoAk.1596249433249
              dpr: '1.25'
              ei: V9UkX6iHGZLbz7sP76iLoAk